List<Map<String, dynamic>> cognitiveDistortionsData = [
  {
    "title": "Эффект Даннинга-Крюгера",
    "description":
        "Эффект Даннинга-Крюгера — это когнитивное искажение, при котором люди с низким уровнем знаний или навыков в определенной области переоценивают свои способности. Это часто происходит из-за недостатка знаний, чтобы понять, что они чего-то не знают.",
    "example":
        "Джон, который только начал изучать программирование, решает, что он уже способен создать сложные приложения, основываясь на нескольких изученных материалах.",
    "howToAvoidTitle": "Признавать, что мы не можем быть экспертами сразу. Чтобы избежать эффекта Даннинга-Крюгера, важно:",
    "howToAvoid": [
      "Признавать, что мы не можем быть экспертами сразу.",
      "Постоянно учиться и развивать свои навыки.",
      "Оценивать свою компетентность критически, искать обратную связь от более опытных людей."
    ]
  },
  {
    "title": "Ошибка выжившего",
    "description":
        "Ошибка выжившего возникает, когда мы принимаем решения или делаем выводы, исходя из информации только о тех, кто «выжил», игнорируя тех, кто потерпел неудачу. Это может привести к искажению восприятия реальности.",
    "example":
        "Мы часто слышим истории успеха людей, которые стали миллионерами, инвестировав в стартапы. Однако мы не знаем обо всех тех, кто вложил деньги в такие же стартапы и потерял их. Ошибка выжившего заставляет нас думать, что успех — это вопрос выбора правильных инвестиций, а не везения или случайных факторов.",
    "howToAvoid": [
      "Важно оценивать всю картину, а не только положительные примеры.",
      "Нужно исследовать и учитывать неудачные проекты, чтобы понимать риски.",
      "Оценивать вероятность успеха на основе всего контекста, а не только истории победителей."
    ]
  },
  {
    "title": "Эффект подтверждения",
    "description":
        "Эффект подтверждения заключается в том, что люди склонны искать, интерпретировать и запоминать информацию, которая подтверждает их собственные убеждения, при этом игнорируя или отклоняя данные, которые могут им противоречить.",
    "example":
        "Люди, поддерживающие определенную политическую партию, могут искать только те новости, которые поддерживают их мнение, и игнорировать информацию, которая его опровергает. Это приводит к укреплению их убеждений и отказу от объективного анализа.",
    "howToAvoid": [
      "Важно осознавать свою склонность к этому и пытаться искать альтернативные точки зрения.",
      "Проводить исследования, используя источники, которые могут предложить противоположные мнения.",
      "Регулярно задавать себе вопрос: «Что если я ошибаюсь?» и открыто подходить к новым фактам и идеям."
    ]
  },
  {
    "title": "Селективное восприятие",
    "description":
        "Это искажение происходит, когда человек выбирает и обращает внимание только на ту информацию, которая подтверждает его мнение, игнорируя остальные данные.",
    "example":
        "В соцсетях мы часто видим посты, которые согласуются с нашими убеждениями, и пропускаем те, которые противоречат им. Это создает искаженное представление о реальности, заставляя нас думать, что все окружающие поддерживают наши взгляды.",
    "howToAvoid": [
      "Следует научиться анализировать информацию более объективно, искать альтернативные точки зрения.",
      "Применять принцип «слушать других» и активно искать мнения людей, которые не согласны с вами.",
      "Уважать мнение других людей и осознавать, что мир не состоит только из подтверждения ваших взглядов."
    ]
  },
  {
    "title": "Эффект якоря (Anchoring Bias)",
    "description":
        "Эффект якоря — это искажение, при котором люди слишком сильно полагаются на первую информацию, которая попадает в их поле зрения, при принятии решений. Эта «якорная» информация влияет на последующие суждения, даже если она не является объективной или релевантной.",
    "example":
        "Вам предлагают два варианта покупки телевизора. Первый стоит 30 000 рублей, а второй — 40 000 рублей. Несмотря на то, что второй телевизор может быть объективно лучше, вам может показаться, что второй вариант слишком дорогой, и вы склоняетесь к первому варианту, ориентируясь на первую сумму (якорь).",
    "howToAvoid": [
      "Всегда проверяйте информацию на объективность и не доверяйтесь первым впечатлениям.",
      "Пытайтесь внести в решение больше факторов и данных, чтобы не застревать на первой информации.",
      "Осознавайте влияние якоря и стремитесь делать более обоснованные выборы, не привязываясь к первым данным."
    ]
  },
  {
    "title": "Эффект фрейминга (Framing Effect)",
    "description":
        "Эффект фрейминга происходит, когда одно и то же сообщение воспринимается по-разному в зависимости от того, как оно представлено. Важно понимать, что слова и контекст могут сильно изменить восприятие.",
    "example":
        "Вам предлагают две страховки:\nСтраховка 1: «Есть 90% вероятность, что вы не столкнетесь с аварией».\nСтраховка 2: «Есть 10% вероятность, что вы столкнетесь с аварией». Хотя информация в обеих страховках одна и та же, фразировка первой предложения более положительна, и люди склонны выбирать её, хотя с математической точки зрения оба варианта идентичны.",
    "howToAvoid": [
      "Важно всегда оценивать информацию не только по тому, как она подается, но и по ее сути.",
      "Сравнивайте информацию в различных контекстах и старайтесь воспринимать её без эмоциональной окраски.",
      "Практикуйте «переформулирование» проблемы, чтобы увидеть её с разных сторон и избежать искажения."
    ]
  },
  {
    "title": "Эффект приверженности (Commitment Bias)",
    "description":
        "Эффект приверженности или «сдвиг подтверждения» проявляется, когда человек продолжает идти по выбранному пути, несмотря на наличие доказательств того, что это решение ошибочно. Это связано с стремлением оправдать уже сделанный выбор, даже если он не приносит результатов.",
    "example":
        "Вы решаете продолжить работать в проекте, который, как оказалось, не имеет перспектив, потому что уже вложили много времени и усилий. Вы не хотите признавать, что решение было ошибочным, и продолжаете тратить ресурсы, даже понимая, что это приведет к большим потерям.",
    "howToAvoid": [
      "Осознайте, что принятие решения — это процесс, и если появляются новые данные, лучше адаптировать стратегию, чем продолжать слепо идти вперед.",
      "Регулярно пересматривайте свои действия и планы, чтобы выявлять, если что-то не работает.",
      "Не бойтесь признать ошибку, когда это необходимо, и скорректировать свой курс."
    ]
  },
  {
    "title": "Эффект группы (Bandwagon Effect)",
    "description":
        "Эффект группы или «эффект следования за толпой» — это когнитивное искажение, при котором люди начинают принимать решения или придерживаться мнений, которые популярны в их социальной группе или среди большинства.",
    "example":
        "Ваша компания решает использовать определенную технологию, и все начинают поддерживать это решение, потому что «все так делают», несмотря на то что технология может быть неподходящей для конкретных нужд вашей команды.",
    "howToAvoid": [
      "Оцените ситуацию на основе фактов и объективных данных, а не на том, что делает большинство.",
      "Применяйте критическое мышление и задавайте вопросы: «Почему это решение принято?» и «Какие могут быть альтернативы?».",
      "Развивайте свою способность делать независимые выводы и следовать своим убеждениям."
    ]
  },
  {
    "title": "Эффект “черной кошки” (Black Cat Syndrome)",
    "description":
        "Это искажение связано с тем, что люди часто оценивают ситуации или явления, исходя из их личного опыта или эмоциональных реакций. Например, если у кого-то был плохой опыт с черной кошкой, это может привести к негативным ассоциациям с любыми черными кошками, даже если это случайный стереотип.",
    "example":
        "Если кто-то однажды столкнулся с проблемами, связанными с определенной личностью, он может перенести негативное восприятие на всех, кто имеет схожие черты, даже если это совершенно разные люди.",
    "howToAvoid": [
      "Осознавайте, что ваш опыт может быть субъективным и не всегда отражает объективную реальность.",
      "Старайтесь не обобщать негативные или положительные впечатления на всех представителей определенной категории.",
      "Ищите разнообразие и избегайте формирования стереотипов."
    ]
  },
  {
    "title": "Эффект страха потери (Loss Aversion)",
    "description":
        "Эффект страха потери — это тенденция людей при принятии решений более остро реагировать на возможные потери, чем на возможные выигрыши. Люди склонны избегать потерь, даже если это приведет к упущению выгод.",
    "example":
        "Вы принимаете участие в инвестиционном проекте и решаете оставить свои деньги в убыточном проекте, чтобы избежать потери, несмотря на то, что его восстановление маловероятно.",
    "howToAvoid": [
      "Оцените риски и выгоды объективно, не принимая решения только исходя из страха потерь.",
      "Учитесь признавать, когда убытки неизбежны, и вовремя прекращать нерентабельные проекты, чтобы минимизировать потери.",
      "Применяйте долгосрочную перспективу для принятия решений, понимая, что иногда риск неизбежен для достижения большего успеха."
    ]
  }
];
