List<Map<String, dynamic>> paradoxesData = [
  {
    "title": "Парадокс Монти Холла",
    "description":
        "Известная задача с тремя дверями. Статистически, вероятность выигрыша увеличивается, если изменить выбор после открытия одной из пустых дверей.",
    "example":
        "Вы выбираете дверь №1. Ведущий открывает дверь №3, за которой пусто. Вероятность выигрыша увеличивается, если сменить выбор на дверь №2.",
    "howToAvoid": [
      "Осознать, что при смене выбора вероятность выигрыша увеличивается.",
      "Понять, что интуиция не всегда верна, особенно когда это касается вероятности."
    ],
  },
  {
    "title": "Парадокс Черного лебедя",
    "description":
        "Относится к событиям, которые невозможно предсказать, но которые оказывают огромное влияние на жизнь.",
    "example":
        "Экономический кризис 2008 года или террористические атаки 11 сентября — события были неожиданными, но изменили мир.",
    "howToAvoid": [
      "Понимать, что мир полон неопределенности и непредсказуемых событий.",
      "Создавать планы на случай неожиданностей и избегать чрезмерного оптимизма."
    ],
  },
  {
    "title": "Парадокс выбора",
    "description":
        "Слишком большое количество вариантов вызывает затруднение и снижает удовлетворенность от принятого решения.",
    "example":
        "Вы пришли в магазин с 50 сортами джема. Множество вариантов перегружает вас, и вы не получаете удовлетворения от выбора.",
    "howToAvoid": [
      "Ограничивайте количество вариантов, чтобы не перегружать разум.",
      "Делайте выбор быстрее и не стремитесь к идеальному результату."
    ],
  },
  {
    "title": "Парадокс Трункования",
    "description":
        "Люди переоценивают важность конкретных элементов задачи, игнорируя более критичные аспекты.",
    "example":
        "Вы не берете запасное колесо в поездку, чтобы оставить место для музыкального инструмента, забывая о реальной необходимости.",
    "howToAvoid": [
      "Думайте о самом важном, а не о том, что бросается в глаза.",
      "Проводите анализ всех аспектов ситуации."
    ],
  },
  {
    "title": "Парадокс Монеты",
    "description":
        "Люди придают большое значение мелким событиям, игнорируя более важные решения и их долгосрочные последствия.",
    "example":
        "Вы находите монету в 10 рублей и радуетесь, забывая о покупке на 1000 рублей, где могли бы сэкономить гораздо больше.",
    "howToAvoid": [
      "Оценивать решения с учетом их долгосрочной ценности.",
      "Сосредотачиваться на значительных действиях, а не на мелких выигрышах."
    ],
  },
  {
    "title": "Парадокс ожидания",
    "description":
        "Слишком высокие ожидания приводят к разочарованию, даже если результат объективно успешен.",
    "example":
        "Вы ожидаете идеальный отдых в дорогом курорте, но сервис не оправдывает ожиданий, вызывая разочарование.",
    "howToAvoid": [
      "Ожидайте хорошие, а не идеальные результаты.",
      "Применяйте принцип \"приятного удивления\" для улучшения восприятия."
    ],
  },
  {
    "title": "Парадокс всемогущества",
    "description":
        "Связан с логическим противоречием абсолютной власти или всемогущества.",
    "example":
        "Может ли всемогущий бог создать камень, который не сможет поднять? Это приводит к логическому парадоксу.",
    "howToAvoid": [
      "Признавать ограничения в возможностях, даже если они неочевидны.",
      "Оценивать проблемы в контексте реальных возможностей."
    ],
  },
];