List<Map<String, dynamic>> quizData = [
  {
    "number": "Квиз 1",
    "quizTitle": "Применение когнитивных искажений в повседневной жизни",
    "questions": [
      {
        "number": "Ситуация 1:",
        "title": "Эффект якоря",
        "description":
            "Вы зашли в магазин и увидели кофейный набор по цене 3000 рублей. Позже в том же магазине вы видите другой набор, который стоит 1500 рублей. Как вы реагируете?",
        "options": [
          "Я решаю, что набор за 1500 рублей — это выгодная покупка.",
          "Я считаю, что 1500 рублей — это слишком много, так как первый набор стоил 3000 рублей.",
          "Я исследую оба набора и решаю, какой из них более полезен, независимо от цены."
        ],
        "correctAnswer": 1,
        "explanation":
            "Эффект якоря заставляет вас воспринимать 1500 рублей как низкую цену только потому, что вы изначально увидели более дорогой набор. Важно оценивать цену по объективным критериям."
      },
      {
        "number": "Ситуация 2:",
        "title": "Ошибка выжившего",
        "description":
            "В интернете вы часто читаете статьи о людях, которые стали успешными, следуя определенному бизнес-плану. Однако многие такие истории не указывают на то, что за каждым успешным случаем могут стоять тысячи неудачных попыток. Как вы относитесь к этим историям?",
        "options": [
          "Я верю, что успех — это просто следование проверенному пути.",
          "Я понимаю, что успех — это исключение, а не правило.",
          "Я думаю, что успех зависит от удачи, а не от плана."
        ],
        "correctAnswer": 2,
        "explanation":
            "Ошибка выжившего заставляет нас игнорировать неудачные случаи и сосредотачиваться только на успешных. Нужно осознавать, что для каждого успешного случая может быть множество неудач."
      },
      {
        "number": "Ситуация 3:",
        "title": "Эффект подтверждения",
        "description":
            "Вы считаете, что диеты с низким содержанием углеводов лучше всего помогают сбросить вес. В поисках информации вы фокусируетесь только на статьях, подтверждающих это мнение. Как вы относитесь к этим статьям?",
        "options": [
          "Я верю этим статьям и считаю, что они подтверждают мою точку зрения.",
          "Я анализирую все доступные данные и пытаюсь рассмотреть противоположные мнения.",
          "Я избегаю чтения противоположных статей, потому что они могут сбить меня с курса."
        ],
        "correctAnswer": 2,
        "explanation":
            "Эффект подтверждения заставляет нас искать и верить только тем источникам, которые подтверждают наше мнение. Важно анализировать информацию с разных точек зрения."
      },
      {
        "number": "Ситуация 4:",
        "title": "Систематическая ошибка при принятии решений",
        "description":
            "Вы собираетесь купить новый смартфон. Вам нравится одна модель, но она имеет несколько слабых характеристик. Вы решаете купить её только из-за бренда. Как вы оцениваете свой выбор?",
        "options": [
          "Я думаю, что мой выбор оправдан, так как бренд всегда гарантирует качество.",
          "Я признаю, что мой выбор может быть основан на эмоциях, а не на рациональной оценке характеристик.",
          "Я оцениваю смартфон только по техническим характеристикам, и бренд не имеет значения."
        ],
        "correctAnswer": 2,
        "explanation":
            "Систематическая ошибка при принятии решений может заставить нас выбирать продукт только из-за известного бренда, даже если его характеристики не лучшие. Важно оценивать продукт объективно."
      },
      {
        "number": "Ситуация 5:",
        "title": "Эффект страха потери",
        "description":
            "Вы купили акции компании за 100 рублей, и сейчас их цена упала до 60 рублей. Вы продолжаете держать их, надеясь на восстановление. Как вы поступаете?",
        "options": [
          "Я решаю продать акции, чтобы минимизировать убытки.",
          "Я держу акции, потому что не хочу фиксировать потерю.",
          "Я продаю акции, чтобы избежать дальнейших потерь."
        ],
        "correctAnswer": 2,
        "explanation":
            "Эффект страха потери заставляет нас избегать фиксирования убытков, даже если это может быть лучшим решением в долгосрочной перспективе."
      }
    ]
  },
  {
    "number": "Квиз 2",
    "quizTitle": "Ловушки мышления и их влияние на повседневные решения",
    "questions": [
      {
        "number": "Ситуация 1:",
        "title": "Парадокс Монти Холла",
        "description":
            "Вы участвуете в телевизионной игре, где перед вами три двери. За одной из дверей спрятан автомобиль, за двумя другими — козы. Вы выбираете одну дверь, и ведущий, который знает, что находится за дверями, открывает одну из оставшихся дверей, показывая козу. Вам предлагают поменять выбор на оставшуюся дверь. Что вы делаете?",
        "options": [
          "Я меняю свой выбор, потому что вероятность выигрыша увеличится.",
          "Я не меняю свой выбор, потому что шанс выигрыша уже 50 на 50.",
          "Я не меняю свой выбор, потому что уверен, что не повезет."
        ],
        "correctAnswer": 1,
        "explanation":
            "Парадокс Монти Холла показывает, что вероятность выигрыша увеличивается, если вы меняете свой выбор, даже если на первый взгляд это кажется нелогичным."
      },
      {
        "number": "Ситуация 2:",
        "title": "Эффект фрейминга",
        "description":
            "Вы идете в ресторан и видите меню с двумя предложениями: '90% из 100 людей довольны этим блюдом.' или '10% из 100 людей не довольны этим блюдом.' Какую фразу вы воспринимаете как более привлекательную?",
        "options": [
          "Я предпочитаю вариант с 90% довольных людей.",
          "Я избегаю блюда с 10% недовольных.",
          "Я не обращаю внимание на то, как информация подана, и выбираю блюдо по его составу."
        ],
        "correctAnswer": 1,
        "explanation":
            "Эффект фрейминга показывает, что люди воспринимают одинаковую информацию по-разному в зависимости от того, как она подана (положительный или отрицательный фрейм)."
      },
      {
        "number": "Ситуация 3:",
        "title": "Ошибка фундаментальной атрибуции",
        "description":
            "Ваш коллега опоздал на встречу. Вы предполагаете, что он неуважительно относится к вам и вашей работе. Но на самом деле у него был неожиданный инцидент. Как вы реагируете?",
        "options": [
          "Я думаю, что это из-за его личных качеств.",
          "Я стараюсь понять внешние обстоятельства, которые могли привести к задержке.",
          "Я злюсь и думаю, что он не уважает меня."
        ],
        "correctAnswer": 2,
        "explanation":
            "Ошибка фундаментальной атрибуции заставляет нас приписывать поведение человека его личным качествам, а не учитывать внешние обстоятельства."
      },
      {
        "number": "Ситуация 4:",
        "title": "Эффект группового мышления",
        "description":
            "В вашей команде на работе все поддерживают одно решение, которое вам кажется сомнительным. Вы боитесь выделяться. Как вы поступаете?",
        "options": [
          "Я поддерживаю решение группы, чтобы не создавать конфликт.",
          "Я выражаю свою точку зрения, даже если это вызывает разногласия.",
          "Я согласен с большинством, потому что легче следовать за ним."
        ],
        "correctAnswer": 2,
        "explanation":
            "Эффект группового мышления может привести к принятию неверных решений, потому что важно следовать мнению большинства, даже если оно ошибочно. Важно проявлять независимость в суждениях."
      },
      {
        "number": "Ситуация 5:",
        "title": "Эффект «я думаю, что все думают как я»",
        "description":
            "В разговоре с другом вы рассказываете о том, как вам нравится новый фильм, и ожидаете, что он тоже его оценит. Ваш друг не разделяет ваше мнение, и это вас удивляет. Как вы реагируете?",
        "options": [
          "Я считаю, что он просто не понял фильма.",
          "Я понимаю, что у людей могут быть разные вкусы и предпочтения.",
          "Я решаю, что фильм действительно плохой, так как никто другой не поддерживает мое мнение."
        ],
        "correctAnswer": 2,
        "explanation":
            "Эффект «я думаю, что все думают как я» заставляет нас думать, что наше мнение является универсальным, но важно помнить, что у людей могут быть разные восприятия."
      }
    ]
  },
  {
    "number": "Квиз 3",
    "quizTitle": "Как избежать когнитивных искажений при принятии решений",
    "questions": [
      {
        "number": "Ситуация 1:",
        "title": "Эффект анкеринга",
        "description":
            "Вы читаете о новинках смартфонов, и вам показывают модель, цена которой составляет 100 000 рублей. Позже вы видите смартфон за 50 000 рублей и считаете его отличным вариантом. Как вы объясняете свое решение?",
        "options": [
          "Я считаю, что смартфон за 50 000 рублей — отличная сделка, так как это гораздо дешевле.",
          "Я начинаю сомневаться, что смартфон за 50 000 рублей может быть хорошим выбором.",
          "Я думаю, что смартфон за 100 000 рублей — это переплата."
        ],
        "correctAnswer": 1,
        "explanation":
            "Эффект анкеринга заставляет вас воспринимать смартфон за 50 000 рублей как выгодную сделку, потому что ранее увиденная цена сыграла роль якоря."
      },
      {
        "number": "Ситуация 2:",
        "title": "Эффект самоуверенности",
        "description":
            "Вы уверены, что выиграете в очередной игре, так как в прошлый раз вам удалось одержать победу. Как вы оцениваете свою уверенность?",
        "options": [
          "Я уверен, что выиграю, потому что мне везет.",
          "Я понимаю, что успех может зависеть от удачи, и не стоит слишком уверенно подходить к игре.",
          "Я не волнуюсь, потому что я хорошо подготовлен и знаю, что мне везет."
        ],
        "correctAnswer": 2,
        "explanation":
            "Эффект самоуверенности может привести к переоценке своих способностей. Важно подходить к решениям с реалистичной оценкой своих возможностей."
      },
      {
        "number": "Ситуация 3:",
        "title": "Логическая ошибка",
        "description":
            "Вы видите рекламу нового продукта, который утверждает, что его использование значительно улучшает здоровье. Что вы думаете об этом продукте?",
        "options": [
          "Я думаю, что это правда, так как все утверждения выглядят убедительными.",
          "Я буду искать дополнительные исследования, чтобы оценить правдивость этих утверждений.",
          "Я думаю, что это маркетинговый ход, и продукт не может быть таким эффективным."
        ],
        "correctAnswer": 2,
        "explanation":
            "Логическая ошибка может заключаться в том, что мы принимаем рекламу за истину. Важно проверять факты и искать объективные данные."
      },
      {
        "number": "Ситуация 4:",
        "title": "Селективное восприятие",
        "description":
            "Вы изучаете тему, которая вам интересна, и при этом фокусируетесь только на материалах, которые подтверждают вашу точку зрения. Что это может означать?",
        "options": [
          "Это означает, что я ищу поддержку для своего мнения.",
          "Это означает, что я должен пересмотреть свои источники информации и искать разнообразие мнений.",
          "Это не проблема, так как я изучаю только то, что мне нужно."
        ],
        "correctAnswer": 2,
        "explanation":
            "Селективное восприятие может привести к ограниченному пониманию темы. Важно рассматривать разные точки зрения."
      },
      {
        "number": "Ситуация 5:",
        "title": "Эффект избыточной уверенности",
        "description":
            "Вы принимаете важное решение в условиях неопределенности, уверенные в своем успехе. Как вы оцениваете свое решение?",
        "options": [
          "Я уверен в своем решении и не сомневаюсь.",
          "Я признаю, что есть риски и неопределенности, и готов адаптировать свои действия.",
          "Я думаю, что все должно сложиться, потому что у меня есть опыт."
        ],
        "correctAnswer": 2,
        "explanation":
            "Эффект избыточной уверенности может заставить нас недооценивать риски. Важно подходить к решению с учетом всех неопределенностей."
      }
    ]
  },
  {
    "number": "Квиз 4",
    "quizTitle": "Как психологические искажения влияют на восприятие",
    "questions": [
      {
        "number": "Ситуация 1:",
        "title": "Эффект преувеличения",
        "description":
            "Вы читаете о новом тренде и решаете, что он идеально вам подходит. Что вы думаете об этом тренде?",
        "options": [
          "Я думаю, что это точно лучший вариант для меня.",
          "Я оцениваю все плюсы и минусы, прежде чем делать выводы.",
          "Я думаю, что это тренд, и он обязательно принесет успех."
        ],
        "correctAnswer": 1,
        "explanation":
            "Эффект преувеличения заставляет нас переоценивать преимущества новых трендов. Важно осознавать, что не каждый тренд подходит всем."
      },
      {
        "number": "Ситуация 2:",
        "title": "Эффект ореола",
        "description":
            "Вы встречаете человека, который производит на вас хорошее впечатление своим внешним видом. Как это влияет на ваше мнение о его личных качествах?",
        "options": [
          "Я думаю, что он хороший человек, потому что он выглядит привлекательно.",
          "Я оцениваю его поведение и личные качества, а не только внешность.",
          "Я не думаю, что его внешний вид влияет на мою оценку."
        ],
        "correctAnswer": 1,
        "explanation":
            "Эффект ореола заставляет нас оценивать личные качества человека, основываясь на его внешности."
      }
    ]
  },
  {
    "number": "Квиз 5",
    "quizTitle": "Распознавание когнитивных искажений в принятии решений",
    "questions": [
      {
        "number": "Ситуация 1:",
        "title": "Ошибка восприятия из-за стереотипов",
        "description":
            "Вы решаете нанять нового сотрудника и оцениваете его кандидатуру на основе его внешности, не учитывая при этом его опыт и квалификацию. Как вы поступаете?",
        "options": [
          "Я нанимаю человека, потому что он выглядит профессионально.",
          "Я оцениваю его опыт и навыки, а не только внешность.",
          "Я обращаю внимание только на внешний вид, потому что это первый критерий при приеме на работу."
        ],
        "correctAnswer": 2,
        "explanation":
            "Ошибка восприятия из-за стереотипов может привести к неправильным решениям. Важно оценивать кандидатов по их профессиональным качествам, а не только по внешним признакам."
      },
      {
        "number": "Ситуация 2:",
        "title": "Иллюзия контроля",
        "description":
            "Вы участвуете в игре, где результат зависит от случайных факторов, но вы уверены, что сможете контролировать исход. Как вы воспринимаете ситуацию?",
        "options": [
          "Я думаю, что мои действия могут повлиять на результат.",
          "Я понимаю, что исход зависит от случайных факторов и не могу его контролировать.",
          "Я уверен, что все зависит от моей подготовки и умения."
        ],
        "correctAnswer": 1,
        "explanation":
            "Иллюзия контроля заставляет нас думать, что мы можем контролировать случайные события. Это когнитивное искажение важно распознавать, чтобы адекватно оценивать ситуацию."
      },
      {
        "number": "Ситуация 3:",
        "title": "Эффект пристрастия к статус-кво",
        "description":
            "Вы долгое время не обновляете программу на своем компьютере, хотя новая версия предлагает улучшения. Почему вы не обновляете?",
        "options": [
          "Я думаю, что обновления могут принести проблемы, и лучше оставить все как есть.",
          "Я обновлю программу, если она действительно улучшает функциональность.",
          "Я не обновляю, потому что мне комфортно с текущей версией."
        ],
        "correctAnswer": 1,
        "explanation":
            "Эффект пристрастия к статус-кво заставляет нас избегать изменений, даже если они могут быть полезными. Важно быть открытым к новому и оценивать изменения объективно."
      },
      {
        "number": "Ситуация 4:",
        "title": "Ошибка статистического прогнозирования",
        "description":
            "Вы решаете инвестировать в стартап, основываясь на том, что многие другие инвесторы уже вложили деньги в этот проект. Как вы поступаете?",
        "options": [
          "Я инвестирую, потому что все делают это, значит, это правильное решение.",
          "Я тщательно исследую проект и принимаю решение на основе объективных данных.",
          "Я думаю, что успех других инвесторов гарантирует успех мне."
        ],
        "correctAnswer": 2,
        "explanation":
            "Ошибка статистического прогнозирования может заставить нас следовать за толпой, не оценивая проект на основе его реальных показателей. Важно принимать решения на основе анализа, а не только на основе чужих действий."
      },
      {
        "number": "Ситуация 5:",
        "title": "Эффект 'плохая новость' (Negative Bias)",
        "description":
            "Вы прочитали несколько негативных отзывов о продукте, но не находите аналогичных положительных. Как вы реагируете?",
        "options": [
          "Я полностью отказываюсь от покупки, так как негативные отзывы перевешивают.",
          "Я ищу как положительные, так и отрицательные отзывы, чтобы получить полную картину.",
          "Я не обращаю внимания на негатив, так как, вероятно, это всего лишь случайные мнения."
        ],
        "correctAnswer": 1,
        "explanation":
            "Эффект плохих новостей заставляет нас придавать большее значение негативным событиям или отзывам, чем положительным. Важно искать баланс и объективно оценивать информацию."
      },
      {
        "number": "Ситуация 6:",
        "title": "Эффект приманки",
        "description":
            "В магазине вам предлагают два продукта:\n- Продукт A: стоит 800 рублей, но имеет базовые функции.\n- Продукт B: стоит 1200 рублей, но имеет дополнительные функции, которые вам не важны.\n- Продукт C: стоит 1000 рублей и имеет те же функции, что и продукт B, но по цене ниже.\nКакой продукт вы выберете?",
        "options": [
          "Продукт A, потому что он дешевле и мне не нужны дополнительные функции.",
          "Продукт B, потому что я считаю, что дополнительные функции могут быть полезны.",
          "Продукт C, потому что он лучше сочетает цену и функции."
        ],
        "correctAnswer": 3,
        "explanation":
            "Эффект приманки заставляет нас выбирать третий вариант (продукт C), хотя он может быть менее выгодным, потому что сравниваем его с более дорогим вариантом B. Важно объективно оценивать, что вам нужно."
      }
    ]
  }
];
